// Задача 15: Напишите программу, которая принимает на вход цифру,
// обозначающую день недели, и проверяет, является ли этот день выходным.
// 6 -> да
// 7 -> да
// 1 -> нет

int n;
n = Convert.ToInt32(Console.ReadLine());
if (n % 6 == 0 || n % 7 == 0)
    Console.WriteLine("Сегодня выходной день!");
else
    Console.WriteLine("Иди работай бездельник!");
